{
  "en": {
    "nav_home": "Home",
    "nav_about": "About",
    "nav_projects": "Projects",
    "nav_contact": "Contact",
    "hero_title": "Mateus Silva",
    "hero_subtitle": "Mobile & Frontend Developer Specialist",
    "hero_description": "Building high-quality, scalable mobile experiences with Flutter, Swift, and Kotlin.",
    "about_title": "About Me",
    "about_text": "I am a developer passionate about technology, with a primary focus on Mobile and Back-end development. My goal is always to improve my stacks and deliver high-quality, scalable solutions.",
    "about_edu": "Graduated in Computer Science from UFS.",
    "skills_title": "Tech Stack",
    "projects_title": "Featured Projects",
    "project_ai_desc": "Intelligent assistant based on AI, exploring modern integrations and LLMs.",
    "project_watch_desc": "Complete app for cataloging and reviewing movies and series.",
    "project_store_desc": "Virtual store implementation consuming REST APIs, focusing on UI/UX and state management.",
    "project_recipes_desc": "Interactive recipes app, demonstrating code organization and persistence.",
    "contact_title": "Get in Touch",
    "contact_text": "Feel free to reach out to discuss technology, partnerships, or opportunities!",
    "view_project": "View Project"
  },
  "pt": {
    "nav_home": "Início",
    "nav_about": "Sobre",
    "nav_projects": "Projetos",
    "nav_contact": "Contato",
    "hero_title": "Mateus Silva",
    "hero_subtitle": "Especialista em Desenvolvimento Mobile e Frontend",
    "hero_description": "Construindo experiências mobile de alta qualidade e escaláveis com Flutter, Swift e Kotlin.",
    "about_title": "Sobre Mim",
    "about_text": "Sou um desenvolvedor apaixonado por tecnologia, com foco principal em Desenvolvimento Mobile e Back-end. Meu objetivo é sempre aprimorar minhas stacks e entregar soluções de alta qualidade e escaláveis.",
    "about_edu": "Graduado em Ciência da Computação pela UFS.",
    "skills_title": "Tecnologias",
    "projects_title": "Projetos em Destaque",
    "project_ai_desc": "Assistente inteligente baseado em IA, explorando integrações modernas e LLMs.",
    "project_watch_desc": "Aplicativo completo de catálogo e avaliações de filmes e séries.",
    "project_store_desc": "Implementação de uma loja virtual consumindo APIs REST, com foco em UI/UX e gerenciamento de estado.",
    "project_recipes_desc": "Aplicativo interativo de receitas, demonstrando organização de código e persistência.",
    "contact_title": "Vamos nos conectar?",
    "contact_text": "Sinta-se à vontade para entrar em contato comigo para discutir sobre tecnologia, parcerias ou oportunidades!",
    "view_project": "Ver Projeto"
  }
}
